# GetRegions Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..GetRegions Method
Face Class See Also
---
Gets the face regions (created, for example, by the Split Face command) of the face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IList<Face> GetRegions()
```

Visual Basic
---
```text
Public Function GetRegions As IList(Of Face)
```

Visual C++
---
```text
public:
IList<Face^>^ GetRegions()
```

# ### Return Value
A list of faces, one for the main face of the object hosting the Split Face (such as wall or floor) and one face for each Split Face regions.
# Remarks
Use the FaceSplitter class to filter and find elements which may generate face regions.
# See Also
Face Class
Autodesk.Revit.DB Namespace